# Set3DInfo

## Description
Procedure Set3DInfo sets the height, width and depth dimensions of the referenced object.

```pascal
PROCEDURE Set3DInfo(
				h              : HANDLE;
				heightDistance : REAL;
				widthDistance  : REAL;
				depthDistance  : REAL);
```

```python
def vs.Set3DInfo(h, heightDistance, widthDistance, depthDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to 3D object.|
|heightDistance|REAL|New height of object.|
|widthDistance|REAL|New width of object.|
|depthDistance|REAL|New depth of object.|

## Version
Availability: from All Versions

## Category
* Objects - 3D